10 months ago, I read [[https://www.learncpp.com/][the entire website]] word by word and coded every
assignment by myself. These subfolders are my commitments to C++.

C++ is hard, that's the reason why this README.org file exists. As I
further explore the world of C++, I find more interesting things, so I write it down.

<2019-02-16 Sat>: In the begaining of 2019, Alex (the creator of
the learnCpp) started to change the structure of website, so I found
some URLs are not correct. Once the the website is stable, I will
update all the links to the new one.

* counter
  :PROPERTIES:
  :ID:       c23c7b6e-2fe2-42dc-b5c8-70382e17dcb9
  :END:

#+begin_src cpp
#include <iostream>
class Something
{
private:
    static int s_idGenerator;
    int m_id;

public:
    Something() { m_id = s_idGenerator++; } // grab the next value from the id generator

    int getID() const { return m_id; }
};

// Note that we're defining and initializing s_idGenerator even though it is declared as private above.
// This is okay since the definition isn't subject to access controls.
int Something::s_idGenerator = 1; // start our ID generator with value 1

int main()
{
    Something first;
    Something second;
    Something third;

    Something t_first;
    Something t_second;
    Something t_third;

    std::cout << t_first.getID() << '\n';
    std::cout << t_second.getID() << '\n';
    std::cout << t_third.getID() << '\n';
    return 0;
}
#+end_src

#+RESULTS:
| 4 |
| 5 |
| 6 |

** [[https://www.learncpp.com/cpp-tutorial/statements-and-the-structure-of-a-program/][1.1 Statements and the structure of a program]]
#+BEGIN_SRC cpp
#include <iostream>

int main()
{
   std::cout << "Hello world! ";
   std::cout << "Just my test";
   return 0;
}

#+END_SRC

#+RESULTS:
: Hello world! Just my test

